Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.GetDefaultValue Method
Overload List
Name | Description
GetDefaultValue(Double)
 Gets the default value of a double property.
GetDefaultValue(Int32)
 Gets the default value of an integer property.
GetDefaultValue(String)
 Gets the default value of a string property.
Top
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace